package days03;

/**
 * @author 조지훈
 * @date 2026. 5. 13. 오전 11:32:19
 * @subject 음수 메모리에 저장될때 표현방식 (음수표현방법) : 2의 보수법
 * @content 
 * 
 */
public class Ex01_04 {

	public static void main(String[] args) {

		byte i = -10;
	      // 10  [0][0][0][0][1][0][1][0]
	      // -10 [1][1][1][1][0][1][1][0]
		
		// STEP1 절대치 ㅣ-10ㅣ ㅡ> 10 ㅡ> 0000 1010 
		// STEP2 1의 보수				  1111 0101
		// STEP3 +1							  1
		// STEP3 합					  1111 0110		  

		/* [문제]
	       * 어떤 음수를 2의 보수법을 취해서 나온 결과값이    10101010
	       * STEP3 -1                            10101001      
	       * STEP2 1의 보수                        01010110
	       * STEP1 절대치 |-??|                          86    
	       * -86
	       * */
		
		
		
		
	} // main

} // class
