package days01;

/**
 * @author 조지훈
 * @date 2026. 5. 11. 오후 4:27:07
 * @subject 자바프로그램의 기본 구조 설명
 * @content 클랙스, main메서드(함수), 
 * 
 */
public class Ex02 {

	public static void main(String[] args) {
		 
		/*
		 * 1. 자바는 객체 지향 프로그래밍 언어이기 때문에 반드시
	프로그램의 시작을 하는 시작개체(==객체,class,물건)가 필요하다.
		 * 2. 자바에서는 클래스 선언 형식
		 *    [접근지정자] 클래스선언예약어 클래스명
		 *    public   class        Ex02 {
		 *    }
		 * 3. 프로그램의 시작/종료(진입점)하는 기능의 
	함수(메서드)가 필요하다: main메서드(함수)
		 * 3-2.
		 *  java Sample 실행(명령프롬프트)
		 *  Ctrl + F11 실행(이클립스) -시작개체( main ) - main메서드를 실행
		 * 4. 자바에서 메서드(함수) 선언 형식
		 *         modifiers == 한정자 (접근지정자+기타제어자)
		 *   [접근지정자] [기타제어자] 리턴자료형 메서드명(매개변수){
		 *   
		 *              [return 반환값;] []대괄호는 생략가능
		 *   
		 *   
		 * 
		 *   }
		 *   public   static   void    main(String[] args) {
		 *   }
		 * 
		 * 4-2. 메서드(함수) 3가지
		 *   1) 기능: 프로그램 시작/ 종료 일(기능)을 하는 함수
		 *   2) 매개변수:
		 *   3) 리턴값(=리턴값):
		 * */

	}

}
